### 8.3.2 Concatenating Along an Axis

另一种数据组合操作可互换地称为拼接，绑定和堆叠,NumPy的concatenate函数可在NumPy数组上实现该功能

In [14]:
import numpy as np
import pandas as pd
arr=np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [15]:
np.concatenate([arr,arr],axis=1) # 按axis=1进行拼接

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [16]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

用列表中的这些对象调用concat方法将值和索引粘在一起

In [17]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

默认情况下，concat方法是沿着axis=0的轴向生效的，生成另一个Series,如果传递axis=1，返回的结果则是一个DataFrame(axis=1时是列)

In [18]:
pd.concat([s1,s2,s3],axis=1)

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [25]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [27]:
pd.concat([s1, s4], axis=1) # 生成DataFrame形式

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [29]:
pd.concat([s1, s4], axis=1, join='inner') # 求交集 即f,g标消失

   0  1
a  0  0
b  1  1

可以使用join_axes来指定用于连接其他轴向的轴

In [30]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

在连接轴向上创建一个多层索引，可使用keys参数来实现

In [31]:
result=pd.concat([s1,s1,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [33]:
result.unstack() # 列向变成横向

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

沿着轴向axis=1连接Series时侯，keys则成为DataFrame的列头

In [35]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three']) # 直接生成DataFrame

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [36]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [37]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [38]:
df2

   three  four
a      5     6
c      7     8

In [39]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

若传递的是对象的字典而不是列表的话，则字典的键会用于keys选项

In [40]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

可以使用names命名生成的轴层级

In [42]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower']) # 命名生成的轴层级

D:\anaconda\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [47]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.arange(6).reshape(2,3), columns=['b', 'd', 'a'])

In [48]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [49]:
df2

   b  d  a
0  0  1  2
1  3  4  5

In [51]:
pd.concat([df1,df2])

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   a  b     c   d
0  0  1   2.0   3
1  4  5   6.0   7
2  8  9  10.0  11
0  2  0   NaN   1
1  5  3   NaN   4

ignore_index 不沿着连接轴保留索引，而是产生一段新的(长度为total_length索引)

In [53]:
pd.concat([df1,df2],ignore_index=True)

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   a  b     c   d
0  0  1   2.0   3
1  4  5   6.0   7
2  8  9  10.0  11
3  2  0   NaN   1
4  5  3   NaN   4

### 8.2.4 Combining Data with Overlap

NumPy数组的where函数，可以进行面向数组的if-else等价操作

In [58]:
a = pd.Series([np.nan, 2.5,0.0, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series([0.,np.nan,2.,np.nan,np.nan,5.],
              index=[ 'a','b','c','d','e','f'])

In [59]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [60]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [62]:
np.where(pd.isnull(a), b, a)
# pd.isnull(a) 判断a是否是缺失值
# 若是缺失值，则用b填补a（按照对应的位置的值填补）
# f    NaN --->  a    0.0
# a    NaN --->  f    5.0

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

Series有一个combine_first方法，该方法等价于下面这种使用pandas常见数据对齐逻辑的轴向操作

In [64]:
b.combine_first(a)
# 用a填补b
# b    NaN --->  b    4.5
# d    NaN --->  d    0.0
# e    NaN --->  e    2.5
# 按照逻辑对齐填补，即对应的索引

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [66]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)}) # 起点为2，终点为18，步长为4  [2,18)
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [67]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [68]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [71]:
df1.combine_first(df2) #  用df2来填补df1 相应的索引

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## 8.3 Reshaping and Pivoting
### 8.3.1 Reshaping with Hierarchical Indexing

1.stack(堆叠)：将数据中的列“旋转”为行
2.unstack(拆堆)：将数据中的行“旋转”为列
3.stack和unstack默认操作为最内层
4.stack和unstack默认旋转轴的级别将会成为结果中的最低级别(最内层)
5.stack和unstack为一组逆运算操作

In [72]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [73]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [74]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

DataFrame.stack(self,level=-1,dropna=True)
level:默认值为-1，即列索引的最后一级
dropna:布尔值，默认为True，即是否删除具有缺失值的行

DataFrame.unstack(self,level=-1,fill_value=None)
level:默认为-1，即行索引的最后一级
fill_value:如果unstatck生成，则用此值替换NaN缺失值

可以传入一个层级序号或名称来拆分一个不同的层级

In [78]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [77]:
result.unstack(0) # 将行名索引变为列名索引

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [80]:
result.unstack('state') # 将行名索引变为列名索引

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

如果层级中的所有值并未包含于每个子分组中时，拆分可能会引入缺失值

In [82]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [83]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [84]:
data2.unstack() # 将最内层的行数据透视到列

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

默认情况下，堆叠会过滤出缺失值，因此堆叠拆堆的操作是可逆的

In [85]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [86]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

dropna 根据每个标签的值是否是缺失数据来筛选轴标签，并根据允许丢失的数据量来确定阈值

In [88]:
data2.unstack().stack(dropna=False)  # 不删除缺失值

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

当你在DataFrame中拆堆时，被拆堆的层级会变成结果中最低的层级

In [89]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [91]:
df.unstack('state')
# 以state为轴进行拆堆
# state原为行索引，拆堆后变成了列索引（即最底层级）
#   side	left	right 层级一
#   state	Ohio	Colorado	Ohio	Colorado 层级二

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

在调用stack时，需要指定堆叠的轴向名称

In [93]:
df.unstack('state').stack('side')
# unstack('state') 为拆堆
# stack('side') 为堆叠

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### 8.3.2 Pivoting “Long” to “Wide” Format

在数据库和CSV中存储多时间序列的方式就是所谓的长格式或堆叠格式（时间序列数据想要观察多个种类的变量在一段时间内的变化）

In [117]:
data=pd.read_csv('examples/macrodata.csv')
data.head() # 读取前5行

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

PeriodIndex将year和quarter等列进行联合并生成了一种时间间隔类型

In [118]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                         name='date')
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
data = data.reindex(columns=columns)
data.index = periods.to_timestamp('D', 'end') # D表示日历日的每天
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [119]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [120]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [121]:
data.head()

item         realgdp  infl  unemp
date
1959-03-31  2710.349  0.00    5.8
1959-06-30  2778.801  2.34    5.1
1959-09-30  2775.488  2.74    5.3
1959-12-31  2785.204  0.27    5.6
1960-03-31  2847.699  2.31    5.2

In [122]:
data.index

DatetimeIndex(['1959-03-31', '1959-06-30', '1959-09-30', '1959-12-31',
               '1960-03-31', '1960-06-30', '1960-09-30', '1960-12-31',
               '1961-03-31', '1961-06-30',
               ...
               '2007-06-30', '2007-09-30', '2007-12-31', '2008-03-31',
               '2008-06-30', '2008-09-30', '2008-12-31', '2009-03-31',
               '2009-06-30', '2009-09-30'],
              dtype='datetime64[ns]', name='date', length=203, freq='Q-DEC')

In [125]:
ldata[:10]

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

这种数据即所谓的多时间序列的长格式，或称为具有两个或更多个键的其他观测值数据（这里，我们的键是data和item）,表中的每一行表示一个时间点上的单个观测值

获取一个按data列时间戳索引的且每个不同的item独立一列的DataFrame，DataFrame的pivot方法就是进行这种转换

In [127]:
pivoted=ldata.pivot('date','item','value')
pivoted

item        infl    realgdp  unemp
date
1959-03-31  0.00   2710.349    5.8
1959-06-30  2.34   2778.801    5.1
1959-09-30  2.74   2775.488    5.3
1959-12-31  0.27   2785.204    5.6
1960-03-31  2.31   2847.699    5.2
1960-06-30  0.14   2834.390    5.2
1960-09-30  2.70   2839.022    5.6
1960-12-31  1.21   2802.616    6.3
1961-03-31 -0.40   2819.264    6.8
1961-06-30  1.47   2872.005    7.0
1961-09-30  0.80   2918.419    6.8
1961-12-31  0.80   2977.830    6.2
1962-03-31  2.26   3031.241    5.6
1962-06-30  0.13   3064.709    5.5
1962-09-30  2.11   3093.047    5.6
1962-12-31  0.79   3100.563    5.5
1963-03-31  0.53   3141.087    5.8
1963-06-30  2.75   3180.447    5.7
1963-09-30  0.78   3240.332    5.5
1963-12-31  2.46   3264.967    5.6
1964-03-31  0.13   3338.246    5.5
1964-06-30  0.90   3376.587    5.2
1964-09-30  1.29   3422.469    5.0
1964-12-31  2.05   3431.957    5.0
1965-03-31  1.28   3516.251    4.9
1965-06-30  2.54   3563.960    4.7
1965-09-30  0.89   3636.285    4.4
1965-12-31  2.90   3724.014    4.1
1966-03-31  4.99   3815.423    3.9
1966-06-30  2.10   3828.124    3.8
...          ...        ...    ...
2002-06-30  1.56  11538.770    5.8
2002-09-30  2.66  11596.430    5.7
2002-12-31  3.08  11598.824    5.8
2003-03-31  1.31  11645.819    5.9
2003-06-30  1.09  11738.706    6.2
2003-09-30  2.60  11935.461    6.1
2003-12-31  3.02  12042.817    5.8
2004-03-31  2.35  12127.623    5.7
2004-06-30  3.61  12213.818    5.6
2004-09-30  3.58  12303.533    5.4
2004-12-31  2.09  12410.282    5.4
2005-03-31  4.15  12534.113    5.3
2005-06-30  1.85  12587.535    5.1
2005-09-30  9.14  12683.153    5.0
2005-12-31  0.40  12748.699    4.9
2006-03-31  2.60  12915.938    4.7
2006-06-30  3.97  12962.462    4.7
2006-09-30 -1.58  12965.916    4.7
2006-12-31  3.30  13060.679    4.4
2007-03-31  4.58  13099.901    4.5
2007-06-30  2.75  13203.977    4.5
2007-09-30  3.45  13321.109    4.7
2007-12-31  6.38  13391.249    4.8
2008-03-31  2.82  13366.865    4.9
2008-06-30  8.53  13415.266    5.4
2008-09-30 -3.16  13324.600    6.0
2008-12-31 -8.79  13141.920    6.9
2009-03-31  0.94  12925.410    8.1
2009-06-30  3.37  12901.504    9.2
2009-09-30  3.56  12990.341    9.6

[203 rows x 3 columns]

传递的前两个值是分别作为行和列索引的列，然后i是可选的数值列以填充DataFrame

In [128]:
ldata['value2']=np.arange(len(ldata))
ldata[:10]

        date     item     value  value2
0 1959-03-31  realgdp  2710.349       0
1 1959-03-31     infl     0.000       1
2 1959-03-31    unemp     5.800       2
3 1959-06-30  realgdp  2778.801       3
4 1959-06-30     infl     2.340       4
5 1959-06-30    unemp     5.100       5
6 1959-09-30  realgdp  2775.488       6
7 1959-09-30     infl     2.740       7
8 1959-09-30    unemp     5.300       8
9 1959-12-31  realgdp  2785.204       9

如果遗漏最后一个参数，会得到一个含有多层列的DataFrame

In [131]:
pivoted=ldata.pivot('date','item')
pivoted[:5]

           value                 value2
item        infl   realgdp unemp   infl realgdp unemp
date
1959-03-31  0.00  2710.349   5.8      1       0     2
1959-06-30  2.34  2778.801   5.1      4       3     5
1959-09-30  2.74  2775.488   5.3      7       6     8
1959-12-31  0.27  2785.204   5.6     10       9    11
1960-03-31  2.31  2847.699   5.2     13      12    14

In [132]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

请注意,pivot方法等价于使用set_index创建分层索引，然后调用unstack

In [136]:
unstacked=ldata.set_index(['date','item']).unstack('item')
unstacked[:7]

           value                 value2
item        infl   realgdp unemp   infl realgdp unemp
date
1959-03-31  0.00  2710.349   5.8      1       0     2
1959-06-30  2.34  2778.801   5.1      4       3     5
1959-09-30  2.74  2775.488   5.3      7       6     8
1959-12-31  0.27  2785.204   5.6     10       9    11
1960-03-31  2.31  2847.699   5.2     13      12    14
1960-06-30  0.14  2834.390   5.2     16      15    17
1960-09-30  2.70  2839.022   5.6     19      18    20

### 8.3.3 Pivoting “Wide” to “Long” Format

在DataFrame中，pivot方法的反操作是pandas.melt,与将一列变换为新的DataFrame中的多列不同，它将多列合并成一列，产生一个新的DataFrame,其长度比输入更长

In [137]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

'key'列可以作为分组指标，其他列均为数据值，当使用pandas.melt时，必须指明哪些列是分组指标。例如用key作为分组指标

In [138]:
melted=pd.melt(df,['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

使用pivot方法，可以将数据重塑回原来的布局

In [139]:
reshaped=melted.pivot('key','variable','value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

由于pivot的结果根据作为行标签的列生成了索引，可使用reset_index将数据回移一列

In [141]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

可以指定列的子集作为值列

In [142]:
pd.melt(df,id_vars=['key'],value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

pandas.melt的使用也可以没有任何分组指标

In [144]:
pd.melt(df,value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [145]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6